Autodesk.Revit.UI.FileOpenDialog.ShowPreview
Identifies if the dialog should include a region showing a preview of the selected file.
The default value is false, to not show the preview area in the dialog. If set to true, note that
Revit may not be able to show a preview of all possible file types.
Since:
2017

Autodesk.Revit.UI.FileOpenDialog.#ctor(System.String,System.String)
Constructs a new instance of a File Open dialog with initial folder.
filter:
The filter string.  See the remarks for Autodesk.Revit.UI.FileDialog.Filter for details.
initialFolder:
Initial folder to browse to when showing the dialog.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input filter string does not meet the minimal requirements for a valid filter string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.UI.FileOpenDialog.#ctor(System.String)
Constructs a new instance of a File Open dialog.
filter:
The filter string.  See the remarks for Autodesk.Revit.UI.FileDialog.Filter for details.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input filter string does not meet the minimal requirements for a valid filter string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.UI.FileOpenDialog
This class allows an add-in to prompt the user with the Revit dialog used to navigate to and select an existing
file path.  This dialog is typically used to select a file for opening or importing.
Remarks:
The behavior and appearance of this dialog matches the Revit "Open" dialog.  This is a general-purpose dialog
for opening any given file type, and options to configure settings like worksharing options will not be included.
The user will be prompted to select an existing file that matches one of the provided filters.  The user may not
enter a file name that does not exist.
The folder location shown when the dialog is displayed defaults to the most recently used file location
for opening or importing.
Use of this dialog does not actually open an existing file, but it will provide the selected file path
back to the caller to take any action necessary.
Since:
2017